In [37]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.read_csv('domestic_visitors/domestic_visitors_2016.csv')
df2 = pd.read_csv('domestic_visitors/domestic_visitors_2017.csv')
df3 = pd.read_csv('domestic_visitors/domestic_visitors_2018.csv')
df4 = pd.read_csv('domestic_visitors/domestic_visitors_2019.csv')

In [4]:
merged_df = pd.concat([df1, df2, df3, df4], ignore_index=True, axis=0, sort=True)

In [45]:
merged_df.to_csv('domestic_visitors.csv', index=False)

In [5]:
dff1 = pd.read_csv('foreign_visitors/foreign_visitors_2016.csv')
dff2 = pd.read_csv('foreign_visitors/foreign_visitors_2017.csv')
dff3 = pd.read_csv('foreign_visitors/foreign_visitors_2018.csv')
dff4 = pd.read_csv('foreign_visitors/foreign_visitors_2019.csv')

In [6]:
merged_df2 = pd.concat([dff1,dff2, dff3, dff4], ignore_index=True, axis=0, sort=True)

In [7]:
merged_df2.to_csv('foreign_visitors.csv', index=False)

In [9]:
merged_df['district'].unique()

array(['Adilabad', 'Bhadradri Kothagudem ', 'Hyderabad', 'Jagtial ',
       'Jangaon ', 'Jayashankar Bhoopalpally', 'Jogulamba Gadwal ',
       'Kamareddy ', 'Karimnagar ', 'Khammam', 'Komaram Bheem Asifabad',
       'Mahabubabad ', 'Mahbubnagar', 'Mancherial', 'Medak ', 'Medchal ',
       'Nagarkurnool ', 'Nalgonda', 'Nirmal', 'Nizamabad', 'Peddapalli',
       'Rajanna Sircilla ', 'Ranga Reddy', 'Sangareddy ', 'Siddipet',
       'Suryapet', 'Vikarabad', 'Wanaparthy ', 'Warangal (Rural)',
       'Warangal (Urban)', 'Yadadri Bhongir', 'Mulugu', 'Narayanapet'],
      dtype=object)

In [10]:
type(merged_df['year'][0])

numpy.int64

In [18]:
print('yes')

yes

In [27]:
# if merged_df['visitors']
merged_df.describe()

             year
count  1512.00000
mean   2017.52381
std       1.12523
min    2016.00000
25%    2017.00000
50%    2018.00000
75%    2019.00000
max    2019.00000

In [44]:
merged_df.fillna(0, inplace=True)

In [69]:
merged_df.dtypes

date        object
district    object
month       object
visitors    object
year         int64
dtype: object

In [68]:
# merged_df = merged_df.astype({'visitors': 'int'})
merged_df['visitors'] = merged_df.visitors.str.strip()
merged_df

            date         district      month visitors  year
0     01-01-2016         Adilabad    January   792136  2016
1     01-02-2016         Adilabad   February   937820  2016
2     01-03-2016         Adilabad      March   582946  2016
3     01-04-2016         Adilabad      April   341948  2016
4     01-05-2016         Adilabad        May   252887  2016
...          ...              ...        ...      ...   ...
1507  01-08-2019  Yadadri Bhongir     August   389010  2019
1508  01-09-2019  Yadadri Bhongir  September   366862  2019
1509  01-10-2019  Yadadri Bhongir    October   381860  2019
1510  01-11-2019  Yadadri Bhongir   November   365990  2019
1511  01-12-2019  Yadadri Bhongir   December   477635  2019

[1512 rows x 5 columns]

### Domestic Visitors to csv file

In [122]:
merged_df.to_csv('domestic_visitors.csv', index=False)

In [82]:
merged_df['visitors'] = merged_df['visitors'].apply(lambda x: 0 if x == '' else x)

In [86]:
merged_df.visitors

0       792136
1       937820
2       582946
3       341948
4       252887
         ...
1507    389010
1508    366862
1509    381860
1510    365990
1511    477635
Name: visitors, Length: 1512, dtype: object

In [90]:
merged_df['visitors'].fillna(0)

0       792136
1       937820
2       582946
3       341948
4       252887
         ...
1507    389010
1508    366862
1509    381860
1510    365990
1511    477635
Name: visitors, Length: 1512, dtype: object

In [99]:
merged_df.visitors = merged_df.visitors.astype('int')

In [95]:
merged_df[merged_df['visitors'].isnull()]

Empty DataFrame
Columns: [date, district, month, visitors, year]
Index: []

In [94]:
merged_df['visitors'] = merged_df['visitors'].fillna(0)

In [100]:
merged_df.dtypes

date        object
district    object
month       object
visitors     int64
year         int64
dtype: object

In [118]:
merged_df.sort_values('district', inplace=True)

In [121]:
merged_df.reset_index(drop=True)

            date         district      month  visitors  year
0     01-01-2016         Adilabad    January    792136  2016
1     01-09-2017         Adilabad  September     42699  2017
2     01-06-2019         Adilabad       June      9161  2019
3     01-05-2019         Adilabad        May      6997  2019
4     01-04-2019         Adilabad      April      9972  2019
...          ...              ...        ...       ...   ...
1507  01-01-2017  Yadadri Bhongir    January    678000  2017
1508  01-07-2017  Yadadri Bhongir       July    481240  2017
1509  01-10-2019  Yadadri Bhongir    October    381860  2019
1510  01-09-2019  Yadadri Bhongir  September    366862  2019
1511  01-12-2019  Yadadri Bhongir   December    477635  2019

[1512 rows x 5 columns]

### Top 10 districts that have the highest number of Domestic visitors overall (2016 - 2019)

In [160]:
district_visitors_sum = []
district_visitors_sum = merged_df.groupby('district')['visitors'].sum()
district_visitors_sum = district_visitors_sum.sort_values(ascending=False)
district_visitors_top = district_visitors_sum[: 10]
district_visitors_top

district
Hyderabad                   83900960
Rajanna Sircilla            41763276
Warangal (Urban)            30726603
Yadadri Bhongir             26893080
Bhadradri Kothagudem        21600962
Medak                       20542639
Jayashankar Bhoopalpally    19632865
Mahbubnagar                 17180118
Nirmal                      13315796
Jagtial                     11303514
Name: visitors, dtype: int64

### Top 3 districts based on CAGR of visitors (2016 - 2019)

In [125]:
merged_df.set_index('district')

                       date      month  visitors  year
district
Adilabad         01-01-2016    January    792136  2016
Adilabad         01-09-2017  September     42699  2017
Adilabad         01-06-2019       June      9161  2019
Adilabad         01-05-2019        May      6997  2019
Adilabad         01-04-2019      April      9972  2019
...                     ...        ...       ...   ...
Yadadri Bhongir  01-01-2017    January    678000  2017
Yadadri Bhongir  01-07-2017       July    481240  2017
Yadadri Bhongir  01-10-2019    October    381860  2019
Yadadri Bhongir  01-09-2019  September    366862  2019
Yadadri Bhongir  01-12-2019   December    477635  2019

[1512 rows x 4 columns]

In [147]:
district_yearly_sum = merged_df.groupby(['district', 'year'])['visitors'].sum()

In [149]:
district_yearly_sum = pd.DataFrame(district_yearly_sum)

In [150]:
district_yearly_sum

                            visitors
district              year
Adilabad              2016   5075557
                      2017    825380
                      2018    644743
                      2019    775895
Bhadradri Kothagudem  2016    889030
...                              ...
Warangal (Urban)      2019   1795230
Yadadri Bhongir       2016   1728600
                      2017   7001728
                      2018  13673378
                      2019   4489374

[126 rows x 1 columns]

In [172]:
district_yearly_sum.reset_index(names=['district', 'year'], inplace=True)

In [226]:
for ind in district_yearly_sum.index:
    ttlsum_16 = district_yearly_sum.loc[district_yearly_sum['year'] == 2016]
    ttlsum_19 = district_yearly_sum.loc[district_yearly_sum['year'] == 2019]

In [227]:
ttlsum_16.reset_index(drop=True)

                    district  year  visitors
0                   Adilabad  2016   5075557
1      Bhadradri Kothagudem   2016    889030
2                  Hyderabad  2016  23394705
3                   Jagtial   2016    623077
4                   Jangaon   2016     40660
5   Jayashankar Bhoopalpally  2016    243400
6          Jogulamba Gadwal   2016    523401
7                 Kamareddy   2016       127
8                Karimnagar   2016   9167468
9                    Khammam  2016   5005031
10    Komaram Bheem Asifabad  2016         0
11              Mahabubabad   2016    140002
12               Mahbubnagar  2016   8304766
13                Mancherial  2016      7802
14                    Medak   2016   3463200
15                  Medchal   2016         0
16             Nagarkurnool   2016    588473
17                  Nalgonda  2016   5858461
18                    Nirmal  2016    916610
19                 Nizamabad  2016      6442
20                Peddapalli  2016      3244
21         Rajanna Sircilla   2016   2176801
22               Ranga Reddy  2016         0
23               Sangareddy   2016    778000
24                  Siddipet  2016    358400
25                  Suryapet  2016         0
26                 Vikarabad  2016         0
27               Wanaparthy   2016     60138
28          Warangal (Rural)  2016     19400
29          Warangal (Urban)  2016  25788035
30           Yadadri Bhongir  2016   1728600

In [231]:
ttlsum_19.reset_index(drop=True, inplace=True)

In [230]:
ttlsum_16.reset_index(drop=True, inplace=True)

In [236]:
ttlsum_19

                    district  year  visitors
0                   Adilabad  2019    775895
1      Bhadradri Kothagudem   2019  12817737
2                  Hyderabad  2019  13802362
3                   Jagtial   2019   3086115
4                   Jangaon   2019    328890
5   Jayashankar Bhoopalpally  2019    662530
6          Jogulamba Gadwal   2019   2007995
7                 Kamareddy   2019       534
8                Karimnagar   2019     77491
9                    Khammam  2019   1413440
10    Komaram Bheem Asifabad  2019     19189
11              Mahabubabad   2019    152885
12               Mahbubnagar  2019   2534815
13                Mancherial  2019    269810
14                    Medak   2019   5452570
15                  Medchal   2019         0
16                    Mulugu  2019   1819800
17             Nagarkurnool   2019   2093312
18                  Nalgonda  2019    140918
19               Narayanapet  2019    389250
20                    Nirmal  2019   3816778
21                 Nizamabad  2019     46333
22                Peddapalli  2019     16581
23         Rajanna Sircilla   2019  16832897
24               Ranga Reddy  2019         0
25               Sangareddy   2019   4553160
26                  Siddipet  2019   2987864
27                  Suryapet  2019         0
28                 Vikarabad  2019         0
29               Wanaparthy   2019    298639
30          Warangal (Rural)  2019    353500
31          Warangal (Urban)  2019   1795230
32           Yadadri Bhongir  2019   4489374

In [238]:
ttlsum_16

                    district  year  visitors
0                   Adilabad  2016   5075557
1      Bhadradri Kothagudem   2016    889030
2                  Hyderabad  2016  23394705
3                   Jagtial   2016    623077
4                   Jangaon   2016     40660
5   Jayashankar Bhoopalpally  2016    243400
6          Jogulamba Gadwal   2016    523401
7                 Kamareddy   2016       127
8                Karimnagar   2016   9167468
9                    Khammam  2016   5005031
10    Komaram Bheem Asifabad  2016         0
11              Mahabubabad   2016    140002
12               Mahbubnagar  2016   8304766
13                Mancherial  2016      7802
14                    Medak   2016   3463200
15                  Medchal   2016         0
16             Nagarkurnool   2016    588473
17                  Nalgonda  2016   5858461
18                    Nirmal  2016    916610
19                 Nizamabad  2016      6442
20                Peddapalli  2016      3244
21         Rajanna Sircilla   2016   2176801
22               Ranga Reddy  2016         0
23               Sangareddy   2016    778000
24                  Siddipet  2016    358400
25                  Suryapet  2016         0
26                 Vikarabad  2016         0
27               Wanaparthy   2016     60138
28          Warangal (Rural)  2016     19400
29          Warangal (Urban)  2016  25788035
30           Yadadri Bhongir  2016   1728600

In [256]:
# number of years
n = 4

result = ttlsum_19.merge(ttlsum_16, on=['district'])
result['CAGR'] = ((result.visitors_x/result.visitors_y)**(1/n) - 1)*100
print(result)

                    district  year_x  visitors_x  year_y  visitors_y
0                   Adilabad    2019      775895    2016     5075557  \
1      Bhadradri Kothagudem     2019    12817737    2016      889030
2                  Hyderabad    2019    13802362    2016    23394705
3                   Jagtial     2019     3086115    2016      623077
4                   Jangaon     2019      328890    2016       40660
5   Jayashankar Bhoopalpally    2019      662530    2016      243400
6          Jogulamba Gadwal     2019     2007995    2016      523401
7                 Kamareddy     2019         534    2016         127
8                Karimnagar     2019       77491    2016     9167468
9                    Khammam    2019     1413440    2016     5005031
10    Komaram Bheem Asifabad    2019       19189    2016           0
11              Mahabubabad     2019      152885    2016      140002
12               Mahbubnagar    2019     2534815    2016     8304766
13                Mancherial    2019      269810    2016        7802
14                    Medak     2019     5452570    2016     3463200
15                  Medchal     2019           0    2016           0
16             Nagarkurnool     2019     2093312    2016      588473
17                  Nalgonda    2019      140918    2016     5858461
18                    Nirmal    2019     3816778    2016      916610
19                 Nizamabad    2019       46333    2016        6442
20                Peddapalli    2019       16581    2016        3244
21         Rajanna Sircilla     2019    16832897    2016     2176801
22               Ranga Reddy    2019           0    2016           0
23               Sangareddy     2019     4553160    2016      778000
24                  Siddipet    2019     2987864    2016      358400
25                  Suryapet    2019           0    2016           0
26                 Vikarabad    2019           0    2016           0
27               Wanaparthy     2019      298639    2016       60138
28          Warangal (Rural)    2019      353500    2016       19400
29          Warangal (Urban)    2019     1795230    2016    25788035
30           Yadadri Bhongir    2019     4489374    2016     1728600

          CAGR
0   -37.471241
1    94.860465
2   -12.358670
3    49.182402
4    68.643972
5    28.446195
6    39.952938
7    43.197153
8   -69.678515
9   -27.101658
10         inf
11    2.225127
12  -25.671611
13  142.500715
14   12.016222
15         NaN
16   37.333616
17  -60.618185
18   42.849287
19   63.763618
20   50.360052
21   66.757369
22         NaN
23   55.536861
24   69.921450
25         NaN
26         NaN
27   49.279230
28  106.607899
29  -48.634034
30   26.947110

In [255]:
r = result.groupby('district').max()
r
r.CAGR.sort_values(ascending=False)

district
Komaram Bheem Asifabad             inf
Mancherial                  142.500715
Warangal (Rural)            106.607899
Bhadradri Kothagudem         94.860465
Siddipet                     69.921450
Jangaon                      68.643972
Rajanna Sircilla             66.757369
Nizamabad                    63.763618
Sangareddy                   55.536861
Peddapalli                   50.360052
Wanaparthy                   49.279230
Jagtial                      49.182402
Kamareddy                    43.197153
Nirmal                       42.849287
Jogulamba Gadwal             39.952938
Nagarkurnool                 37.333616
Jayashankar Bhoopalpally     28.446195
Yadadri Bhongir              26.947110
Medak                        12.016222
Mahabubabad                   2.225127
Hyderabad                   -12.358670
Mahbubnagar                 -25.671611
Khammam                     -27.101658
Adilabad                    -37.471241
Warangal (Urban)            -48.634034
Nalgonda                    -60.618185
Karimnagar                  -69.678515
Medchal                            NaN
Ranga Reddy                        NaN
Suryapet                           NaN
Vikarabad                          NaN
Name: CAGR, dtype: float64

### CAGR Formula

In [197]:
# number of years
n = 4
# price in 2019
ev = 1
# price in 2016
bv = 1

# cagr formula
cagr = ((ev/bv)**(1/n) - 1)*100
print(cagr)

111.47425268811281